<div style="background-color:darkgreen; text-align:center; font-color:white; vertical-align: middle; padding:10px;">
<font color="white" size = 5 >Functions and Grouping </font>
</div>

Functions
---------------------

In [142]:
%load_ext sql
%sql sqlite:///chinook.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

--
 
**`%sql` is used for single line SQL commands:**  
**`%%sql` is used for multiple lines SQL commands:**

In [143]:
%%sql 

SELECT *
FROM Employees
LIMIT 5;

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2002-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com'),
 (3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2002-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com'),
 (4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2003-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com'),
 (5, 'Johnson', 'Steve', 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2003-10-17 00:00:00', '7727B 41 Ave', 'Calgary', 'AB', 'Canada', 'T3B 1Y7', '1 (780) 836-9987', '1 (780) 836-9543', 'steve@chinookcorp.com')]

In [144]:
%%sql 

SELECT *
FROM Customers
LIMIT 5;

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (2, 'Leonie', 'Köhler', None, 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4)]

In [145]:
%%sql 

-- Use * to count the number of rows returned from a query

SELECT count(*)
FROM Employees;

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
Done.

[(8,)]

In [146]:
%%sql 

-- What about counting distinct job titles in the Employees table?
-- First just display the distinct titles

SELECT distinct title
FROM Employees;

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
Done.

[('General Manager',),
 ('Sales Manager',),
 ('Sales Support Agent',),
 ('IT Manager',),
 ('IT Staff',)]

In [147]:
%%sql 

-- What we want to count is the result of selecting the distinct titles

SELECT count(distinct title) as "#titles"
FROM Employees;

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
Done.

[(5,)]

In [148]:
%%sql 

-- NOT CORRECT! Notice this just returns a count of the number of rows since each row has a value in the title column.

SELECT count (title) as "#titles"
FROM Employees;

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
Done.

[(8,)]

In [149]:
%%sql 

-- TASK1: Show each job title and a count of the number of employees

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
0 rows affected.

[]

In [150]:
%%sql 

-- Task2: How many customers per country?

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
0 rows affected.

[]

In [151]:
%%sql 

-- Task2: How many customers per country and city?  Sort in descending order.

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
0 rows affected.

[]

In [152]:
%%sql 

-- Task3: How many customers from USA?

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
0 rows affected.

[]

In [153]:
%%sql

SELECT *
FROM Invoices
LIMIT 5;

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
Done.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86)]

In [154]:
%%sql

-- Task4: The total column represents the total invoice cost.
-- What is the min, max, and average invoice total?  Display column headings as shown.  
-- Round the average to 2 digits after decimal point.

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
0 rows affected.

[]

In [155]:
%%sql

-- Task5: The total column represents the total invoice cost.
-- What is the average invoice total per billing country?  
-- Round the average to 2 digits after decimal point.
-- Sort by descending order

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
0 rows affected.

[]

In [156]:
%%sql

-- Task6 - How many invoices with billing country of USA or Canada?

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
0 rows affected.

[]

In [157]:
%%sql

-- Task7: Which countries result in most sales? Keep in mind the total column  represents the total for one invoice.
-- You need to sum up the total column.  Display results with total sales over 100.

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
0 rows affected.

[]

In [158]:
%%sql

-- Task8: Show the number of invoices for each billing city in the USA.  
-- Do not hardcode Mountain View in your query.

 * sqlite:///chinook.db
   sqlite:///studentgrades.db
0 rows affected.

[]